export const initialState = {
  user: {
    value: null,
    error: null,
  },
  // validation: {
  //   error: null,
  //   value: false,
  //   /*   
  //   number: null //Насколько я понял это код с каптчей,
  //   @Максим ты делаешь авторизацию, если что-то сломается 
  //   то я ей выпилил. Будет понятно где начинать дебаггинг*/
  // },
  posts: [{
    id: 1,
    master_id: 2,
    system_id: 1,
    title: "Рудники Фанделвера",
    platform: "Roll20+Discord",
    description: "Требования к игрокам: возможность на более-менее постоянной основе играть в указанное время? не конфликтность, умение читать и понимать прочитанное. Можно новичкам, чему смогу - научу, объясню.",
  }, {
    id: 2,
    master_id: 2,
    system_id: 1,
    title: "Рудники Фанделвера",
    platform: "Roll20+Discord",
    description: "Требования к игрокам: возможность на более-менее постоянной основе играть в указанное время? не конфликтность, умение читать и понимать прочитанное. Можно новичкам, чему смогу - научу, объясню.",
  },
  {
    id: 3,
    master_id: 2,
    system_id: 1,
    title: "Рудники Фанделвера",
    platform: "Roll20+Discord",
    description: "Требования к игрокам: возможность на более-менее постоянной основе играть в указанное время? не конфликтность, умение читать и понимать прочитанное. Можно новичкам, чему смогу - научу, объясню.",
  }]//[]
}


